BOT_TOKEN = "6062694135:AAFUgOSo_xcbS22xP2q-qZNyncJHlPwSHFY"
FULL_NAME = "Flugabwehrraketensystem Roland auf Radkraftfahrzeug"

MURAD_TEXT_PATH = "static/murad.txt"
GOING_TO_THE_RIVER_PATH = "static/going_to_the_river.txt"
FLARAKRAD_PATH = "static/flarakrad.txt"
POEMS_PATH = "static/poems.txt"
POEMS_SEPARATOR = "***"

REGISTER_WORDS = ['reg', 'register', 'регистрация', 'зарегаться']
LOGIN_WORDS = ['log', 'login', 'авторизация', 'вход']
EXIT_WORDS = ['выход', 'exit']
STOP_WORDS = ['stop', 'стоп']
INFO_WORDS = ['info', 'information', 'инфо', 'инфа', 'информация']
RANDOM_CASE_WORDS = ['случайная задача 🤔', 'случайная задача', 'задача', 'рандомная задача', 'case', 'random case']
RANDOM_PLACE_WORDS = ['случайное место 🌍', 'случайное место', 'место', 'рандомное место', 'place', 'random place']
RANDOM_POEM_WORDS = ['случайная поэма 📖', 'случайная поэма', 'стих',
                     'рандомный стих', 'стихотворение', 'поэма', 'poem', 'random poem']
CHANGE_COMPANION = ['позвать мурада 🔞', 'позвать идущего к реке', 'позвать flarakrad', 'слушать эхо']
COMPANIONS = ['Murad', 'Going To The River', 'FlaRakRad', 'Echo']
HELP_WORDS = ['help', 'помощь', 'помощь 🆘', 'хелп']
HELLO_WORDS = ['say hello', 'say hi', 'скажи привет']

HELP_TEXT = """Возникли вопросы?, я помогу!!!
Перед тем, как воспользоваться полным функционалом бота, вам нужно войти в аккаунт
Регистрация -> /register_user
Вход -> /login_user
***
Случайная задача: бот задаёт рандомный пример, решите его (он лёгкий)
Случайное место: бот кидает координаты и снимок какого-то места
Случайная поэма: бот пишет стих (взял из игры Doki Doki Literature Club, потому что стихи обалденные)
***
Ниже представлен выбор собеседников. Попробуйте!
***
Инфо: инфа о текущем пользователе (вот это дааа)
Выход: всё понятно, если не чайник
/info_bot: информация о боте.

>_  ** Admin only **
/get_all_users_info: Вывод инфы о всех пользователях
/reload_data: перезагрузка данных (файлов .txt)

UPD:
Если что не так с клавиатурой (такое маловероятно, но всё же)
напишите /start
"""

MIN_AND_MAX_LONGITUDE = (1000, 7500)
MIN_AND_MAX_SCALE = (1, 2000)

VERSION = 1.0
DEV_NAME = "Пономарев Илья Сергеевич"
DEV_GIT_HUB = "https://github.com/QWERTY1WASD/Project-WEB"
DEV_TG_NAME = "@delovoy_ilyxa"
